-- phpMyAdmin SQL Dump
-- version 5.2.1
-- https://www.phpmyadmin.net/
--
-- Host: 127.0.0.1
-- Generation Time: Dec 02, 2025 at 04:52 PM
-- Server version: 10.4.32-MariaDB
-- PHP Version: 8.2.12

SET SQL_MODE = "NO_AUTO_VALUE_ON_ZERO";
START TRANSACTION;
SET time_zone = "+00:00";


/*!40101 SET @OLD_CHARACTER_SET_CLIENT=@@CHARACTER_SET_CLIENT */;
/*!40101 SET @OLD_CHARACTER_SET_RESULTS=@@CHARACTER_SET_RESULTS */;
/*!40101 SET @OLD_COLLATION_CONNECTION=@@COLLATION_CONNECTION */;
/*!40101 SET NAMES utf8mb4 */;

--
-- Database: `books`
--

-- --------------------------------------------------------

--
-- Table structure for table `books`
--

CREATE TABLE `books` (
  `id` int(11) NOT NULL,
  `name` varchar(255) NOT NULL,
  `image` varchar(255) NOT NULL,
  `pdf_file` varchar(255) DEFAULT NULL,
  `auther` varchar(255) NOT NULL,
  `desc` text NOT NULL,
  `type` varchar(255) NOT NULL,
  `price` varchar(255) NOT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_general_ci;

--
-- Dumping data for table `books`
--

INSERT INTO `books` (`id`, `name`, `image`, `pdf_file`, `auther`, `desc`, `type`, `price`) VALUES
(1, 'ارسس الجزء الأول', 'photo_2024-04-21_13-27-34.jpg', '(mktbtypdf.com)-آرسس.pdf', 'أحمد ال حمدان', 'رواية خيالية علمية من تأليف الكاتب السعودي أحمد آل حمدان، تتميز بدمجها بين التشويق والمغامرة والخيال العلمي، وتدور أحداثها حول اكتشاف جسم فضائي غامض بالقرب من الأرض وتكليف فريق سري سعودي بمهمة استكشافه، مما يقودهم إلى مغامرات ومواجهات مثيرة ويكشف أسراراً مذهلة. الرواية تتضمن أيضاً عنصراً للسفر عبر الزمن. ', 'خيال ', '170'),
(2, 'ارسس الجزء الثاني', 'arses2.jpg', '(mktbtypdf.com)-آرسس-2.pdf', 'أحمد ال حمدان', 'تواصل الأحداث بعد اكتشاف جسم فضائي غريب يقترب من سماء السعودية. تكمل الرواية قصة الجزء الأول وتغوص في عالم الخيال العلمي والفانتازيا، حيث يواجه الأبطال مغامرات صعبة ومواجهات مثيرة أثناء رحلتهم للحصول على حجر آرسس وإنقاذ العالم. ', 'خيال ', '100'),
(3, ' قضية ست الحسن', 'قضية-ست-الحسن-تحقيقات-نوح-الألفي-18735-1000x1500-webp.webp', 'قضية ست الحسن.pdf', 'ميرنا المهدي', 'تُذبح طالبة بطريقة بشعة، وتُترك في سيارتها بميدان التحرير. صحفي شهير يتحول إلى رماد، والعجيب أن النيران لم تمس شيئًا آخر في شقته، ورسالة من مجهول مكتوبة على الحائط وراءه: «الله أكبر». زوجة منتج شهير تُلقى من شرفتها ليلة رأس السنة. وأخيرًا، تسمُّم 15 من أطفال الشوارع في ظروف غامضة.\r\nضابط عادي كان سيقف عاجزًا أمام ملابسات هذه القضايا، لكن نوح الألفي – الذي تعرَّض لحادث جعله يبصر غوامض لا يراها غيره – وزميله قطز، ليسا ضابطين عاديين. معهما نبدأ الكتاب الأول من سلسلة «تحقيقات نوح الألفي».', 'جريمة', '150'),
(5, 'القربان', 'القربان.jpg', '(mktbtypdf.com)-القربان.pdf', 'مروة جوهر', 'رواية رعب نفسية للكاتبة المصرية مروى جوهر تدور حول طفلة اسمها \"راحيل\" تسيطر عليها روح شريرة تطالب بتقديم قربان لإرضاء قوى العالم السفلي. تحاول خالتها، مورين، إنقاذها من خلال صراع مع القوى الماورائية والتحكم في الشر، وسط خيانة من الأشخاص المقربين للطفلة. تجمع الرواية بين عناصر الرعب والإثارة والغموض، وتستكشف صراعات بين الخير والشر، والأطماع الخفية، والتضحية. ', 'رعب', '187'),
(6, 'قضية لوز مر', 'لوز مر.jpg', '(mktbtypdf.com)-قضية-لوز-مر.pdf', 'ميرنا المهدي', 'رواية \"قضية لوز مر\" هي الجزء الثاني من سلسلة \"تحقيقات نوح الألفي\" للكاتبة ميرنا المهدي، وتدور حول محاولة الضابط نوح الألفي وصديقه قطز كشف لغز جرائم قتل غامضة تحدث في ظروف متتالية، حيث تختفي القاتلة المتسلسلة \"روح لوز مر\" لتبدأ سلسلة جرائم تبدو كأنها سكتات قلبية. تجمع الرواية بين التشويق البوليسي والقضايا الإنسانية العميقة، مع التركيز على العلاقات الأسرية والصراعات النفسية', 'جريمة', '150'),
(7, 'قضية عنب الثعلب', 'قضية-عنب-الثعلب.jpg', 'عنب الثعلب.pdf', 'ميرنا المهدي', '\"قضية عنب الثعلب\" هي رواية بوليسية من تأليف ميرنا المهدي، وهي الجزء الثالث في سلسلة \"تحقيقات نوح الألفي\". تدور أحداثها حول ضابطي الشرطة نوح الألفي وقطز المحمدي، اللذين يتورطان في قضية معقدة تتضمن اختفاء رضيع وجريمة انتحار ولوحة فنية غامضة. يتميز الضابط نوح بقدرة استثنائية على رؤية ما لا يراه الآخرون، مما يساعده في حل أسرار القضية. ', 'جريمة', '150'),
(8, 'قضية ذيل القط', 'رواية-قضية-ذيل-القط-–-ميرنا-المهدي.jpg', 'ديل القط.pdf', 'ميرنا المهدي', '\"قضية ذيل القط\" هي رواية جريمة غامضة، وهي الجزء الرابع من سلسلة \"تحقيقات نوح الألفي\" للكاتبة ميرنا المهدي، وتدور أحداثها حول جرائم قتل متتابعة في مركز اتصالات. يجد المحقق نوح الألفي نفسه أمام قاتل ماهر يترك ذيل قطة كدليل وحيد، بينما تبدو أوصاف القاتل مطابقة لزميل له. تجمع الرواية بين الإثارة والغموض والتحليل النفسي، وتتميز بنهاية غير متوقعة. ', 'جريمة', '150'),
(9, 'متلازمة فريجولي', 'متلازمة فريجولي.png', '(mktbtypdf.com)-متلازمة-فريجولي.pdf', 'منال معشي', 'متلازمة فريجولي هي اضطراب نفسي نادر يُعتقد فيه المريض أن أشخاصاً مختلفين يراهم في الحقيقة شخصٌ واحد فقط يتنكر أو يغير مظهره باستمرار. غالباً ما يشعر المصاب بأنهم يعيشون في عالم سريالي أو مسرحي حيث يتغير الآخرون من حوله، مما يسبب له شعوراً بالارتياب والقلق والارتباك. ترتبط هذه المتلازمة عادة بحالات نفسية أخرى مثل الفصام واضطرابات المزاج، أو بعد إصابات دماغية مثل السكتات الدماغية أو الزهايمر، وتؤثر بشكل كبير على التفاعل الاجتماعيد', 'نفسية', '80'),
(10, 'حقل التفاح', 'حقل التفاح.png', '(mktbtypdf.com)-حقل-التفاح.pdf', 'منال معشي', '\"حقل التفاح\" هي رواية للكاتبة منال معشي، وهي الجزء الثاني من سلسلة \"متلازمة فريجولي\" الأدبية. تندرج الرواية تحت أدب الرعب النفسي والتشويق، وتدور أحداثها في قرية \"السنابل\" حول معالج نفسي يحمل ماضيًا إجراميًا يعود إلى قريته ومعه مراهق يعاني من اضطراب متلازمة فريجولي', 'نفسية', '155'),
(11, 'لأنها كيارا', 'رواية-لأنها-كيارا.png', 'رواية لأنها كيارا(1).pdf', 'سما سامي', 'رواية \"لأنها كيارا\" للكاتبة سما سامي هي رواية فانتازيا عربية مشوقة، تدور أحداثها حول كيارا، فتاة يتيمة، تتعرض للاختطاف والحرق على يد سحرة، لتستيقظ بعد ذلك في منزل أليكس، الذي يتضح أنه مصاص دماء. تبدأ كيارا رحلة للبحث عن هويتها الحقيقية وفهم ما حدث لها، بينما يحاول أليكس التعامل مع وجودها في منزله. تمزج الرواية بين الخيال، الغموض، والمغامرة، وتستكشف عوالم مصاصي الدماء والسحرة. ', 'فانتازيا', '75'),
(12, 'مملكة الكوابيس والضباب', 'مملكة الكوابيس والضباب.jpg', 'رواية مملكة الكوابيس والضباب.pdf', 'سما سامي', '\"مملكة الكوابيس والضباب\"، وتعتبر رواية فانتازيا ورومانسية تتابع أحداث كيارا بعد أن اكتشفت هويتها، حيث تكتشف المزيد من الأسرار عن ماضيها وأسباب السعي لقتلها. في هذا الجزء، تسعى كيارا لفهم دوافع \"استل\" وسبب عودة \"ارويك\" وتورط شخص ما في جثة في \"ريفر ريتش\"(لانها كيارا الجزء الثاني).', 'فانتازيا', '75'),
(13, 'العرش الأسود', 'العرش الاسود.jpg', 'العرش الاسود.pdf', 'سما سامي', 'الجزء الثالث من سلسلة \"لأنها كيارا\" هو العرش الأسود، وهو يكمل رحلة كيارا بعد اكتشافها أن أليكس مصاص دماء. تواصل كيارا البحث عن هويتها وحقيقة اختطافها وإدانتها، حيث تواجه عوالم مصاصي الدماء والسحرة وتستكشف أسراراً جديدة في هذه السلسلة الخيالية التي تمزج بين التشويق والمغامرة. ', 'فانتازيا', '75'),
(14, '005', '005.jpg', '005.pdf', 'شهد قربان', 'رواية \"005\" هي رواية تشويق ورومانسية للكاتبة شهد قربان تدور أحداثها في عالم الجريمة والعصابات، حيث يُكلف قاتل مستأجر بمهمة القضاء على امرأة بريئة تُسحب حياتها المسالمة إلى عالم مظلم مليء بالخيانة والأسرار. تتميز الرواية بحبكة معقدة وصراع بين الأبطال، مع التركيز على الجانب النفسي والعاطفي للشخصيات. ', 'بوليسية', '100'),
(15, 'ستوكهولم', 'ستوكهولم.jpg', '(mktbtypdf.com)-ستوكهولم.pdf', 'شهد قربان', ' رواية \"ستوكهولم\"، وهي الجزء الثاني من سلسلة روايات \"005\" للكاتبة شهد قربان. تدور أحداث الرواية في عالم الجريمة والغموض، وتتبع قصة \"روبي سميث\" التي تجد نفسها في مواجهة \"005\"، وهو قاتل مأجور بارع، بعد أن يتم تكليف هذا القاتل بالقضاء عليها. تبدأ الأحداث في المكسيك وتتعمق في عالم مظلم مليء بالمطاردات والأسرار، حيث تتشابك الأقدار بين \"روبي\" و\"005\" و\"إحدى أخطر العائلات في العالم\". ', 'بوليسية', '100'),
(16, 'البارون', '-رواية-البارون-لشهد-قربان-.jpg', '(mktbtypdf.com)-البارون.pdf', 'شهد قربان', 'رواية \"البارون\". تصف الرواية في جزئها الثالث قصة حب معقدة بين \"روبي\" و\"مارسيل\" (المعروف بـ 005) في عالم مليء بالجريمة، حيث تتداخل الرومانسية بالغموض والخطر', 'بوليسية', '100'),
(17, 'إيكادولي', 'إيكادولي.jpg', 'إيكادولي.pdf', 'حنان لاشين', '\"إيكادولي\" هي رواية فانتازيا خيالية من تأليف حنان لاشين، وتُعد الجزء الأول من سلسلة \"مملكة البلاغة\". تدور أحداثها في عالم خيالي حيث الكتب حية ويستطيع القراء من خلالها استدعاء محاربين من عالمهم للدفاع عن قيم الكتب. الرواية تمزج بين الخيال والواقع، وتتضمن رسائل هادفة عن القيم والفضائل، وتُظهر حبكات مبتكرة في صراع الخير والشر. ', 'فانتازيا', '150'),
(18, 'أوبال', 'أوبال.jpg', 'أوبال.pdf', 'حنان لاشين', 'رواية \"أوبال\" هي رواية فانتازيا خيالية للكاتبة د. حنان محمود لاشين، وهي الجزء الثاني من سلسلة \"مملكة البلاغة\" وتدور أحداثها حول \"حبيبة\" ومغامراتها في الدفاع عن مملكة البلاغة وتخليصها من ساحرات \"أوبالس\" الشريرات، بالتوازي مع قصة \"أنس\" الذي يدافع عن الفضائل في عالمه الخيالي. تُعرف الرواية بأسلوبها الذي يمزج بين الخيال والعقل والقلب، وتقديمها لمبادئ وقيم إسلامية من خلال أحداث مشوقة وشخصيات متعددة. ', 'فانتازيا', '150'),
(19, 'أمانوس', 'امانوس.jpg', 'أمانوس.pdf', 'حنان لاشين', 'رواية \"أمانوس\" هي الجزء الثالث من سلسلة \"مملكة البلاغة\" للكاتبة د. حنان لاشين. تدور أحداثها حول الشاب \"أنس\" الذي يخوض رحلة إلى مملكة البلاغة الخيالية ليحارب الشر ويدافع عن القيم، ويكتشف قدرات جديدة ويقع في حب \"مرام\". الرواية تمزج بين الخيال، الحب، والتاريخ، وتركز على قيم العقل والقلب والروح، وتحمل مغامرات مثيرة ومليئة بالأحداث الغريبة التي تنتهي بانتصار الخير على الشر', 'فانتازيا', '150'),
(20, 'كويكول', 'كويكول.jpg', 'كويكول.jpg', 'حنان لاشين', 'رواية \"كويكول\" هي الجزء الرابع من سلسلة \"مملكة البلاغة\" للكاتبة حنان لاشين، وتدور أحداثها في مدينة رومانية أثرية بالجزائر تحمل الاسم نفسه. تركز الرواية على مفاهيم مثل الحرية، الاستعباد، والتضحية، حيث تستدعي المملكة محاربين من القراء للدفاع عن القيم الموجودة بداخل الكتب. ', 'فانتازيا', '150'),
(21, 'سقطري', 'سقطري.jpg', 'سقطرى.pdf', 'حنان لاشين', 'رواية \"سقطرى\" للدكتورة حنان لاشين هي رواية خيالية تتناول مغامرة عائلة أبادول في جزيرة سقطرى اليمنية، حيث يقومون بمهمة لإنقاذ الشعوب المنسية والبحث عن بوابات لمملكة البلاغة. تدور الأحداث حول شخصيات مثل أنس وفرح وسليمان وخالد، الذين يواجهون تحديات ويحصل كل منهم على قدرات خاصة (ميراث خاص) نتيجة مغامراتهم. تتميز الرواية بدمجها بين سحر الأدب العربي الشرقي وتشويق الأدب الغربي، مع التركيز على قوة الكلمات والتحديات الوجودية التي تواجه الأبطال في بيئة الجزيرة الفريدة. ', 'فانتازيا', '150'),
(22, 'سيروش', 'سيروش.jpg', 'سيروش.pdf', 'حنان لاشين', 'رواية \"سيروش\" هي رواية خيالية من تأليف الكاتبة المصرية حنان لاشين، وهي الجزء السادس من سلسلة \"مملكة البلاغة\". تدور أحداثها حول شاب مصري اسمه سيروش يكتشف امتلاكه لقدرات خارقة، مثل القدرة على التحكم في الضوء والطاقة، مما يجعله مختلفًا عن الآخرين. تتناول الرواية قصة حب وتحديات وصعوبات تواجه البطل، مستوحاة في بعض جوانبها من قصص الحب العالمية مثل \"روميو وجولييت\". ', 'فانتازيا', '150'),
(23, 'أبادول', 'ابادول.jpg', '(mktbtypdf.com)-أبادول.pdf', 'حنان لاشين', 'رواية \"أبادول\" للدكتورة حنان لاشين هي الجزء السابع من سلسلة \"مملكة البلاغة\" وتدور أحداثها حول \"أنس\" الذي يكتشف أسرار عائلته المحاربة، خاصةً جده \"أبادول\". يغوص الراوي في ماضي الجد ليكتشف رحلته المليئة بالأسرار والمواجهات مع كائنات الجن، ويتعلم أن للكلمات قوة هائلة. تمزج الرواية بين الخيال والفلسفة، وتسلط الضوء على مفاهيم مثل قوة الإيمان، والشجاعة، وقيمة الكلمة والمعرفة. ', 'فانتازيا', '150'),
(24, 'واحة اليعقوب', 'رواية-واحة-اليعقوب.jpg', '(mktbtypdf.com)-واحة-اليعقوب-معدل.pdf', 'عمرو عبد الحميد', 'واحة اليعقوب ليست مجرد رواية فانتازيا، بل هي مرآة تعكس صراعات الإنسان مع ذاته ومع مجتمعه، فمن خلال عالم غامض تحكمه قوانين غير مألوفة يدفعنا عمرو عبد الحميد للتفكير في مفاهيم الهوية، والقدر، والتضحية، لذا إذا كنت تبحث عن قصة تأخذك في رحلة فريدة من نوعها فإن هذه الرواية تستحق القراءة.', 'فانتازيا', '100'),
(25, 'هذا ما حدث معها', 'هذا ما حدث معها.jpg', '(mktbtypdf.com)-هذا-ما-حدث-معها.pdf', 'أسامة المسلم', 'رواية \"هذا ما حدث معها\" للكاتب أسامة المسلم هي رواية تشويقية نفسية واجتماعية تدور أحداثها حول مذيع يمتلك برنامجاً إذاعياً شهيراً، ويحكي في الرواية قصته وتفاصيل حياته المهنية قبل شهرته، خاصة التحديات التي واجهها وكيف وصل إلى هذا البرنامج. تركز الرواية على موضوعات إنسانية عميقة مثل الصدمات النفسية وتأثير الماضي على الحاضر. ', 'الغموض', '80'),
(26, 'هذا ما حدث معي', 'هذا-ما-حدث-معي.jpg', 'رواية هذا ما حدث معي PDF - أسامة المسلم.pdf', 'أسامة المسلم', 'تدور أحداثها حول مذيع إذاعي يقرر تقديم برنامج ليلي يتلقى فيه اتصالات من المستمعين يشاركون فيها قصصهم الغريبة والمخيفة. مع تقدم الأحداث، يجد المذيع نفسه متورطًا في عالم من الأسرار المظلمة والكيانات الخارقة للطبيعة', 'الغموض', '90'),
(27, 'أرض زيكولا', 'أرض_زيكولا.jpg', 'ارض زيكولا.pdf', 'عمرو عبد الحميد', 'أرض زيكولا هي أرض خيالية تعتمد على \"وحدات الذكاء\" كوحدة تعامل بدلاً من المال، حيث يزداد رصيد الفرد منها عند العمل ويقل عند الشراء. تتميز هذه الأرض بطقسها السنوي المعروف بـ \"يوم الزيكولا\" الذي يُضحى فيه بمن يمتلك أقل عدد من وحدات الذكاء، والذي يتنافس في لعبة حتى يُختار ليكون الضحية. ', 'خيال ', '100'),
(28, 'أماريتا', 'اماريتا.jpg', 'اماريتا.pdf', 'عمرو عبد الحميد', '(ارض زيكولا 2) هي رواية خيالية تدور أحداثها في عالم موازٍ يعتمد على الذكاء كوحدة قياس للثروة، حيث تُصبح زيكولا عالمًا يسوده الخوف بعد أن تحولت من أرض احتفالات إلى أرض تسودها القسوة. ويكشف الكتاب عن تفاصيل أسرار وخفايا \"أماريتا\" وتفاعلات الشخصيات مع الأحداث، مع استمرار صراع خالد والبطلة أسيل، ويكشف عن خيانة أسيل واحتلال ملك أماريتا لزيكولا. ', 'خيال ', '100'),
(29, 'وادي الذئاب المنسية', 'وادي الذئاب المنسية.jpg', 'وادي الذئاب المنسية.pdf', 'عمرو عبد الحميد', 'تصف عالمًا خياليًا يحكمه ملك يُدعى \"شاهد السماء\" ويتعايش فيه البشر مع الذئاب والملديون في سلام. تتبع القصة موسى، الذي يحاول إيجاد فرصة للخروج من بلدته بعد أن تعبر ذئبٌ رهيب إحدى العابرات الست. تتميز الرواية بالأسلوب السردي المثير، والمغامرات، والتشويق، كما تبرز قصة حب بين موسى وشخصية أخرى تدعى تميم. (ارض زيكولا 3)', 'خيال ', '100'),
(30, 'قواعد جارتين', 'قواعد جارتين.jpg', 'قواعد جارتين.pdf', 'عمرو عبد الحميد', 'تدور أحداثها في عالم \"جارتين\" الذي يقسم سكانه إلى طبقتين: الأشراف والنسالى. يصف الجزء الأول القواعد الصارمة للنظام، مثل حظر الزواج بين الطبقتين وعدم السماح لأحد بتجاوز عمر الخمسين، ويركز على حياة النساليين المليئة بالظلم والقهر، مقارنة بحياة الأشراف المرفهة. تبدأ الأحداث تشتعل مع شخصية \"أسيل\" التي تتحول من رافضة للنساليين إلى قائدة للثورة ضدهم', 'خيال ', '100'),
(31, 'دقات الشامو', 'دقات الشامو.jpg', 'دقات الشامو.pdf', 'عمرو عبد الحميد', 'تكملة لسلسلة \"قواعد جارتين\". تدور أحداثها بعد انهيار النظام السابق في الوادي، حيث تستمر الصراعات بين الشرفاء والنسالي، بينما يكافح أبطال الرواية مع المشاكل الاجتماعية والعاطفية، وتستكشف الرواية العلاقات الإنسانية المعقدة تحت وطأة الفوضى والفوضى. ', 'خيال ', '100'),
(32, 'أمواج أكما', 'امواج اكما.jpg', 'أمواج أكما.pdf', 'عمرو عبد الحميد', 'الجزء الثالث والأخير من سلسلة \"قواعد جارتين\" لعمرو عبد الحميد، ويتناول قضايا الظلم الاجتماعي والتمييز الطبقي، والصراع من أجل المساواة، والتمرّد على القواعد الظالمة، مع التركيز على التضحية من أجل الآخرين، وتدور أحداثه بعد انتهاء أحداث الجزء الثاني، حيث يواجه الأبطال المواجهة الأخيرة لكشف حقيقة \"الأكاذيب\" التي بُنيت عليها المدينة، وتقديم حلول للشخصيات، والكشف عن أسرار \"الأكما\" التي شكلت محور الأحداث طوال السلسلة. ', 'خيال ', '100'),
(33, 'فتاة الياقة الزرقاء', 'فتاة الياقة الزرقاء.jpg', 'فتاة الياقة الزرقاء.pdf', 'عمرو عبد الحميد', 'تدور أحداثها في عالم مستقبلي قمعي تديره نخبة حاكمة، حيث تُعتبر النساء اللواتي ولدن بدون رحم \"فتيات الياقة الزرقاء\" أدوات لاستغلالهن. تتابع الرواية قصة \"ليلي\" التي تقرر النضال من أجل حقوق هؤلاء النساء وإنقاذ شقيقتها الصغيرة من مصير مأساوي، وتلتحق بحركة مقاومة ضد النظام الحاكم. ', 'فانتازيا', '95');

-- --------------------------------------------------------

--
-- Table structure for table `buyer`
--

CREATE TABLE `buyer` (
  `id` int(11) NOT NULL,
  `name` varchar(255) NOT NULL,
  `email` varchar(255) NOT NULL,
  `password` varchar(255) NOT NULL,
  `address` varchar(255) NOT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_general_ci;

--
-- Dumping data for table `buyer`
--

INSERT INTO `buyer` (`id`, `name`, `email`, `password`, `address`) VALUES
(1, 'sandra', 'sandra6767@gmail.com', '667799@sandra', 'egypt,gharbia,elmahalla,elabasey street'),
(2, 'فاطمة عثمان', 'fatma5858@gmail.com', '32154872584fatma', 'مصر, طنطا , سبرباي'),
(3, 'nada', 'nada678@gmail.com', 'nadanada4321', 'مصر , الدقهلية , المنصورة'),
(4, 'شيري', 'shery789@gmail.com', 'sheryshery789', 'مصر, طنطا , المعرض');

-- --------------------------------------------------------

--
-- Table structure for table `message`
--

CREATE TABLE `message` (
  `id` int(11) NOT NULL,
  `name` varchar(255) NOT NULL,
  `email` varchar(255) NOT NULL,
  `mess` varchar(255) NOT NULL,
  `creat_at` datetime DEFAULT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_general_ci;

--
-- Dumping data for table `message`
--

INSERT INTO `message` (`id`, `name`, `email`, `mess`, `creat_at`) VALUES
(1, 'nada', 'nada77@gmail.com', 'very nice!!', '2025-10-18 17:05:14'),
(2, 'ahmed', 'ahmed213@gmail.com', ' If all you did today was wake up, that’s enough, and I’m proud of you', '2025-11-09 13:11:17'),
(3, 'asmaa', 'farawlafaro00@gmail.com', 'the web is verey nice , i love it ❤', '2025-11-09 13:25:05'),
(4, 'asmaa', 'asmaa67@gmail.com', 'keep going❤', NULL),
(5, 'marwa', 'marwa7878@gmail.com', 'ممتاز جدا , استمري ????', NULL);

-- --------------------------------------------------------

--
-- Table structure for table `orders`
--

CREATE TABLE `orders` (
  `id` int(11) NOT NULL,
  `name` varchar(255) NOT NULL,
  `image` varchar(255) NOT NULL,
  `price` varchar(255) NOT NULL,
  `quantity` varchar(255) NOT NULL,
  `total` varchar(255) NOT NULL,
  `book_id` varchar(255) NOT NULL,
  `buyer_name` varchar(255) NOT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_general_ci;

--
-- Dumping data for table `orders`
--

INSERT INTO `orders` (`id`, `name`, `image`, `price`, `quantity`, `total`, `book_id`, `buyer_name`) VALUES
(1, 'ارسس الجزء الثاني', 'arses2.jpg', '100', '1', '100', '2', 'sandra'),
(3, 'ارسس الجزء الأول', 'photo_2024-04-21_13-27-34.jpg', '170', '1', '170', '1', 'فاطمة عثمان'),
(4, ' قضية ست الحسن', 'قضية-ست-الحسن-تحقيقات-نوح-الألفي-18735-1000x1500-webp.webp', '150', '1', '150', '3', 'sandra'),
(7, 'قضية ذيل القط', 'رواية-قضية-ذيل-القط-–-ميرنا-المهدي.jpg', '150', '1', '150', '8', 'sandra'),
(8, 'ارسس الجزء الأول', 'photo_2024-04-21_13-27-34.jpg', '170', '1', '170', '1', 'sandra');

-- --------------------------------------------------------

--
-- Table structure for table `timeline_events`
--

CREATE TABLE `timeline_events` (
  `id` int(11) NOT NULL,
  `user_name` varchar(100) NOT NULL,
  `event_type` enum('register','purchase') NOT NULL,
  `title` varchar(255) NOT NULL,
  `description` text NOT NULL,
  `icon` varchar(100) DEFAULT 'glyphicon-pushpin',
  `color` varchar(50) DEFAULT 'antiquewhite',
  `created_at` datetime DEFAULT current_timestamp()
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_general_ci;

--
-- Dumping data for table `timeline_events`
--

INSERT INTO `timeline_events` (`id`, `user_name`, `event_type`, `title`, `description`, `icon`, `color`, `created_at`) VALUES
(1, 'farawla', 'register', 'new user was signed in website✅', 'sign-in new user', 'glyphicon-user', '#915831', '2025-11-09 15:24:11'),
(2, 'sara', 'purchase', 'sara was bought books', 'new sales', 'glyphicon-shopping-cart', '#915831', '2025-11-09 15:24:11'),
(3, 'alaa', 'register', 'تسجيل مستخدم جديد', 'تم تسجيل المستخدم alaa بنجاح في الموقع.', 'glyphicon-user', '#915831', '2025-11-16 18:10:57'),
(4, 'فاطمة عثمان', 'register', 'تسجيل مشتري جديد', 'تم تسجيل المشتري فاطمة عثمان بنجاح في الموقع.', 'glyphicon-user', '#915831', '2025-11-26 15:43:31'),
(5, 'فاطمة عثمان', 'purchase', 'عملية شراء جديدة', 'قام المشتري فاطمة عثمان بشراء القربان\'\'.', 'glyphicon-shopping-cart', '#915831', '2025-11-26 16:19:32'),
(6, 'sandra', 'purchase', 'عملية شراء جديدة', 'قام المشتري sandra بشراء قضية ست الحسن\'\'.', 'glyphicon-shopping-cart', '#915831', '2025-11-26 16:50:13'),
(7, 'sandra', 'purchase', 'عملية شراء جديدة', 'قام المشتري  sandra بشراء ارسس الجزء الثاني\'\'.', 'glyphicon-shopping-cart', '#915831', '2025-11-26 16:51:59'),
(8, 'sandra', 'purchase', 'عملية شراء جديدة', 'قام المشتري sandra بشراء  قضية لوز مر \'\'.', 'glyphicon-shopping-cart', '#915831', '2025-11-26 17:04:28'),
(9, 'asmaa', 'purchase', 'عملية شراء جديدة', 'قام المشتري asmaa بشراء  قضية ذيل القط \'\'.', 'glyphicon-shopping-cart', '#915831', '2025-11-26 17:52:58'),
(10, 'sandra', 'purchase', 'عملية شراء جديدة', 'قام المشتري sandra بشراء  قضية ذيل القط \'\'.', 'glyphicon-shopping-cart', '#915831', '2025-11-26 17:59:41'),
(11, 'sandra', 'purchase', 'عملية شراء جديدة', 'قام المشتري sandra بشراء  ارسس الجزء الأول \'\'.', 'glyphicon-shopping-cart', '#915831', '2025-11-26 18:00:04'),
(12, 'nada', 'register', 'تسجيل مشتري جديد', 'تم تسجيل المشتري nada بنجاح في الموقع.', 'glyphicon-user', '#915831', '2025-11-28 18:57:31'),
(13, 'شيري', 'register', 'تسجيل مشتري جديد', 'تم تسجيل المشتري شيري بنجاح في الموقع.', 'glyphicon-user', '#915831', '2025-12-02 14:38:13');

-- --------------------------------------------------------

--
-- Table structure for table `users`
--

CREATE TABLE `users` (
  `id` int(11) NOT NULL,
  `name` varchar(255) NOT NULL,
  `email` varchar(255) NOT NULL,
  `password` varchar(255) NOT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_general_ci;

--
-- Dumping data for table `users`
--

INSERT INTO `users` (`id`, `name`, `email`, `password`) VALUES
(1, 'sally', 'sally3010@gmail.com', '3010552002'),
(2, 'asmaa', 'asmaa67@gmail.com', '552002@asmaa'),
(3, 'marawan', 'marawan88@gmail.com', '012012012@marawan'),
(4, 'alaa', 'alaa0909@gmail.com', '20205050alaa');

--
-- Indexes for dumped tables
--

--
-- Indexes for table `books`
--
ALTER TABLE `books`
  ADD PRIMARY KEY (`id`);

--
-- Indexes for table `buyer`
--
ALTER TABLE `buyer`
  ADD PRIMARY KEY (`id`);

--
-- Indexes for table `message`
--
ALTER TABLE `message`
  ADD PRIMARY KEY (`id`);

--
-- Indexes for table `orders`
--
ALTER TABLE `orders`
  ADD PRIMARY KEY (`id`);

--
-- Indexes for table `timeline_events`
--
ALTER TABLE `timeline_events`
  ADD PRIMARY KEY (`id`);

--
-- Indexes for table `users`
--
ALTER TABLE `users`
  ADD PRIMARY KEY (`id`);

--
-- AUTO_INCREMENT for dumped tables
--

--
-- AUTO_INCREMENT for table `books`
--
ALTER TABLE `books`
  MODIFY `id` int(11) NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=34;

--
-- AUTO_INCREMENT for table `buyer`
--
ALTER TABLE `buyer`
  MODIFY `id` int(11) NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=5;

--
-- AUTO_INCREMENT for table `message`
--
ALTER TABLE `message`
  MODIFY `id` int(11) NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=6;

--
-- AUTO_INCREMENT for table `orders`
--
ALTER TABLE `orders`
  MODIFY `id` int(11) NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=9;

--
-- AUTO_INCREMENT for table `timeline_events`
--
ALTER TABLE `timeline_events`
  MODIFY `id` int(11) NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=14;

--
-- AUTO_INCREMENT for table `users`
--
ALTER TABLE `users`
  MODIFY `id` int(11) NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=5;
COMMIT;

/*!40101 SET CHARACTER_SET_CLIENT=@OLD_CHARACTER_SET_CLIENT */;
/*!40101 SET CHARACTER_SET_RESULTS=@OLD_CHARACTER_SET_RESULTS */;
/*!40101 SET COLLATION_CONNECTION=@OLD_COLLATION_CONNECTION */;
